html/FrontEnd/z_kehouti_vue.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>课后题 (jQuery)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliusan/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">课后题 (jQuery)</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0d534e2">1. 第一章</a></li>
<li><a href="#orgcf6c50a">2. 第二章</a></li>
<li><a href="#org971a90c">3. 第三章</a></li>
<li><a href="#org62ca594">4. 第四章</a></li>
<li><a href="#org53c9c5c">5. 第五章</a></li>
<li><a href="#org0318b0a">6. 第六章</a></li>
<li><a href="#org670c9d4">7. 第七章</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org0d534e2" class="outline-2">
<h2 id="org0d534e2"><span class="section-number-2">1</span> 第一章</h2>
<div class="outline-text-2" id="text-1">
<p>
实操题 (P47):
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #c678dd; font-weight: bold;">!doctype</span> html&gt;
<span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">html</span> <span style="color: #61afef;">lang</span>=<span style="color: #98be65;">"en"</span><span style="color: #8c8c8c;">&gt;</span>
  <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">head</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">meta</span> <span style="color: #61afef;">charset</span>=<span style="color: #98be65;">"UTF-8"</span>/<span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">title</span><span style="color: #8c8c8c;">&gt;</span><span style="font-weight: bold; text-decoration: underline;">Document</span><span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">title</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">style</span><span style="color: #8c8c8c;">&gt;</span>
     <span style="color: #61afef;">tr:nth-child</span><span style="color: #8c8c8c;">(</span><span style="color: #61afef;">odd</span><span style="color: #8c8c8c;">)</span><span style="color: #61afef;"> </span><span style="color: #8c8c8c;">{</span>
       <span style="color: #c678dd; font-weight: bold;">background</span>: <span style="color: #000000; background-color: #ddd;">#ddd</span>;
     <span style="color: #8c8c8c;">}</span>
     <span style="color: #61afef;">table </span><span style="color: #8c8c8c;">{</span>
       <span style="color: #c678dd; font-weight: bold;">width</span>: 400px;
     <span style="color: #8c8c8c;">}</span>
     <span style="color: #61afef;">.bg </span><span style="color: #8c8c8c;">{</span>
       <span style="color: #c678dd; font-weight: bold;">display</span>: flex;
       <span style="color: #c678dd; font-weight: bold;">justify-content</span>: space-around;
     <span style="color: #8c8c8c;">}</span>
    <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">style</span><span style="color: #8c8c8c;">&gt;</span>
  <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">head</span><span style="color: #8c8c8c;">&gt;</span>
  <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">body</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">table</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"tbl"</span><span style="color: #8c8c8c;">&gt;</span>
      <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">thead</span><span style="color: #8c8c8c;">&gt;</span>
        <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">tr</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;&lt;</span><span style="color: #61afef;">input</span> <span style="color: #61afef;">type</span>=<span style="color: #98be65;">"checkbox"</span> <span style="color: #61afef;">class</span>=<span style="color: #98be65;">"ca"</span><span style="color: #8c8c8c;">&gt;&lt;</span>/<span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;</span>&#32534;&#21495;<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;</span>&#20219;&#21153;<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;</span>&#29366;&#24577;<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;</span>
          <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;</span>&#25805;&#20316;<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">th</span><span style="color: #8c8c8c;">&gt;</span>
        <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">tr</span><span style="color: #8c8c8c;">&gt;</span>
      <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">thead</span><span style="color: #8c8c8c;">&gt;</span>
      <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">tbody</span><span style="color: #8c8c8c;">&gt;</span>
      <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">tbody</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">table</span><span style="color: #8c8c8c;">&gt;</span>
    <span style="color: #8c8c8c;">&lt;</span><span style="color: #61afef;">script</span><span style="color: #8c8c8c;">&gt;</span>
     <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">data</span> = <span style="color: #8c8c8c;">[</span>
       <span style="color: #93a8c6;">{</span>id: 101, task: <span style="color: #98be65;">'&#19978;&#35838;'</span>, status: 1<span style="color: #93a8c6;">}</span>,
       <span style="color: #93a8c6;">{</span>id: 102, task: <span style="color: #98be65;">'&#30561;&#35273;'</span>, status: 0<span style="color: #93a8c6;">}</span>,
       <span style="color: #93a8c6;">{</span>id: 103, task: <span style="color: #98be65;">'&#25171;&#28216;&#25103;'</span>, status: 0<span style="color: #93a8c6;">}</span>
     <span style="color: #8c8c8c;">]</span>;
     <span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef;">renderTasks</span><span style="color: #8c8c8c;">()</span> <span style="color: #8c8c8c;">{</span>
       <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">result</span> = <span style="color: #98be65;">''</span>;
       <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">i</span> = 0; i &lt; data.length; i++<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
         <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">task</span> = data<span style="color: #b0b1a3;">[</span>i<span style="color: #b0b1a3;">]</span>;
         result += <span style="color: #98be65;">`</span>
<span style="color: #98be65;">           &lt;tr data-id='${task.id}'&gt;</span>
<span style="color: #98be65;">             &lt;td&gt;&lt;input type=checkbox value=${task.id} class='cb'&gt;&lt;/td&gt;</span>
<span style="color: #98be65;">             &lt;td&gt;${task.id}&lt;/td&gt;</span>
<span style="color: #98be65;">             &lt;td&gt;${task.task}&lt;/td&gt;</span>
<span style="color: #98be65;">             &lt;td&gt;${task.status === 0 ? '&#26410;&#23436;&#25104;' : '&#24050;&#23436;&#25104;'}&lt;/td&gt;</span>
<span style="color: #98be65;">             &lt;td class=bg&gt;</span>
<span style="color: #98be65;">               &lt;a href='#' class=del&gt;&#21024;&#38500;&lt;/a&gt;</span>
<span style="color: #98be65;">               &lt;a href='#' class=arch&gt;${task.status === 0 ? '&#23436;&#25104;' : '&#26410;&#23436;&#25104;'}&lt;/a&gt;</span>
<span style="color: #98be65;">               &lt;a href='#'&gt;&#32534;&#36753;&lt;/a&gt;&lt;/td&gt;</span>
<span style="color: #98be65;">           &lt;/tr&gt;</span>
<span style="color: #98be65;">         `</span>;
       <span style="color: #93a8c6;">}</span>
       document.querySelector<span style="color: #93a8c6;">(</span><span style="color: #98be65;">'.tbl tbody'</span><span style="color: #93a8c6;">)</span>.innerHTML = result;
     <span style="color: #8c8c8c;">}</span>
     <span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef;">bindEvents</span><span style="color: #8c8c8c;">()</span> <span style="color: #8c8c8c;">{</span>
       <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">tbl</span> = document.querySelector<span style="color: #93a8c6;">(</span><span style="color: #98be65;">'.tbl'</span><span style="color: #93a8c6;">)</span>;
       tbl.addEventListener<span style="color: #93a8c6;">(</span><span style="color: #98be65;">'click'</span>, <span style="color: #b0b1a3;">(</span>e<span style="color: #b0b1a3;">)</span> =&gt; <span style="color: #b0b1a3;">{</span>
         <span style="color: #c678dd; font-weight: bold;">if</span> <span style="color: #97b098;">(</span>e.target.classList.contains<span style="color: #aebed8;">(</span><span style="color: #98be65;">'ca'</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span> <span style="color: #97b098;">{</span>
           <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">cbs</span> = document.querySelectorAll<span style="color: #aebed8;">(</span><span style="color: #98be65;">'.cb'</span><span style="color: #aebed8;">)</span>;
           <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #aebed8;">(</span><span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">i</span> = 0; i &lt; cbs.length; i++<span style="color: #aebed8;">)</span> <span style="color: #aebed8;">{</span>
             cbs<span style="color: #b0b0b3;">[</span>i<span style="color: #b0b0b3;">]</span>.checked = !cbs<span style="color: #b0b0b3;">[</span>i<span style="color: #b0b0b3;">]</span>.checked;
           <span style="color: #aebed8;">}</span>
           <span style="color: #c678dd; font-weight: bold;">return</span>;
         <span style="color: #97b098;">}</span>
         <span style="color: #c678dd; font-weight: bold;">if</span> <span style="color: #97b098;">(</span>e.target.classList.contains<span style="color: #aebed8;">(</span><span style="color: #98be65;">'del'</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span> <span style="color: #97b098;">{</span>
           <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">id</span> = e.target.parentNode.parentNode.dataset.id;
           data = data.filter<span style="color: #aebed8;">(</span>v =&gt; v.id != id<span style="color: #aebed8;">)</span>;
           renderTasks<span style="color: #aebed8;">()</span>;
           <span style="color: #c678dd; font-weight: bold;">return</span>;
         <span style="color: #97b098;">}</span>
         <span style="color: #c678dd; font-weight: bold;">if</span> <span style="color: #97b098;">(</span>e.target.classList.contains<span style="color: #aebed8;">(</span><span style="color: #98be65;">'arch'</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span> <span style="color: #97b098;">{</span>
           <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">id</span> = e.target.parentNode.parentNode.dataset.id;
           <span style="color: #c678dd; font-weight: bold;">for</span> <span style="color: #aebed8;">(</span><span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">i</span> = 0; i &lt; data.length; i++<span style="color: #aebed8;">)</span> <span style="color: #aebed8;">{</span>
             <span style="color: #c678dd; font-weight: bold;">var</span> <span style="color: #61afef;">task</span> = data<span style="color: #b0b0b3;">[</span>i<span style="color: #b0b0b3;">]</span>;
             <span style="color: #c678dd; font-weight: bold;">if</span> <span style="color: #b0b0b3;">(</span>task.id == id<span style="color: #b0b0b3;">)</span> <span style="color: #b0b0b3;">{</span>
               task.status = task.status == 0 ? 1 : 0;
               renderTasks<span style="color: #90a890;">()</span>;
               <span style="color: #c678dd; font-weight: bold;">return</span>;
             <span style="color: #b0b0b3;">}</span>
           <span style="color: #aebed8;">}</span>
         <span style="color: #97b098;">}</span>
       <span style="color: #b0b1a3;">}</span><span style="color: #93a8c6;">)</span>;
       <span style="color: #8c8c8c;">}</span>
     renderTasks<span style="color: #8c8c8c;">()</span>;
     bindEvents<span style="color: #8c8c8c;">()</span>;
    <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">script</span><span style="color: #8c8c8c;">&gt;</span>
  <span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">body</span><span style="color: #8c8c8c;">&gt;</span>
<span style="color: #8c8c8c;">&lt;</span>/<span style="color: #61afef;">html</span><span style="color: #8c8c8c;">&gt;</span>
</pre>
</div>
</div>
</section>

<section id="outline-container-orgcf6c50a" class="outline-2">
<h2 id="orgcf6c50a"><span class="section-number-2">2</span> 第二章</h2>
<div class="outline-text-2" id="text-2">
<p>
代码题 (P82):
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #61afef;">Student</span> <span style="color: #8c8c8c;">(</span> <span style="color: #61afef;">properties</span> <span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #da8548; font-weight: bold;">this</span>.name = properties.name;
  <span style="color: #da8548; font-weight: bold;">this</span>.age = properties.age;
  <span style="color: #da8548; font-weight: bold;">this</span>.uid = properties.uid;
  <span style="color: #da8548; font-weight: bold;">this</span>.sex = properties.sex;
  <span style="color: #da8548; font-weight: bold;">this</span>.getname = <span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #93a8c6;">()</span> <span style="color: #93a8c6;">{}</span>;
  <span style="color: #da8548; font-weight: bold;">this</span>.setname = <span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #93a8c6;">()</span> <span style="color: #93a8c6;">{}</span>;
  <span style="color: #da8548; font-weight: bold;">this</span>.getuid =  <span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #93a8c6;">()</span> <span style="color: #93a8c6;">{}</span>;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</section>

<section id="outline-container-org971a90c" class="outline-2">
<h2 id="org971a90c"><span class="section-number-2">3</span> 第三章</h2>
<div class="outline-text-2" id="text-3">
<p>
日期格式化 (P123):
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #687080; font-style: italic;">// </span><span style="color: #687080; font-style: italic;">&#20351;&#29992; replace &#21363;&#21487;&#23436;&#25104;</span>
Date.<span style="color: #da8548; font-weight: bold;">prototype</span>.formate = <span style="color: #c678dd; font-weight: bold;">function</span> <span style="color: #8c8c8c;">(</span><span style="color: #61afef;">fmt</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
    <span style="color: #c678dd; font-weight: bold;">return</span> fmt.replace<span style="color: #93a8c6;">(</span><span style="color: #98be65;">'yyyy'</span>, <span style="color: #da8548; font-weight: bold;">this</span>.getFullYear<span style="color: #b0b1a3;">()</span><span style="color: #93a8c6;">)</span>
        .replace<span style="color: #93a8c6;">(</span><span style="color: #98be65;">'MM'</span>, <span style="color: #da8548; font-weight: bold;">this</span>.getMonth<span style="color: #b0b1a3;">()</span> + 1<span style="color: #93a8c6;">)</span>
        .replace<span style="color: #93a8c6;">(</span><span style="color: #98be65;">'dd'</span>, <span style="color: #da8548; font-weight: bold;">this</span>.getDate<span style="color: #b0b1a3;">()</span><span style="color: #93a8c6;">)</span>
        .replace<span style="color: #93a8c6;">(</span><span style="color: #98be65;">'hh'</span>, <span style="color: #da8548; font-weight: bold;">this</span>.getHours<span style="color: #b0b1a3;">()</span><span style="color: #93a8c6;">)</span>
        .replace<span style="color: #93a8c6;">(</span><span style="color: #98be65;">'mm'</span>, <span style="color: #da8548; font-weight: bold;">this</span>.getMinutes<span style="color: #b0b1a3;">()</span><span style="color: #93a8c6;">)</span>
        .replace<span style="color: #93a8c6;">(</span><span style="color: #98be65;">'ss'</span>, <span style="color: #da8548; font-weight: bold;">this</span>.getSeconds<span style="color: #b0b1a3;">()</span><span style="color: #93a8c6;">)</span>;
<span style="color: #8c8c8c;">}</span>;
<span style="color: #c678dd; font-weight: bold;">new</span> <span style="color: #61afef;">Date</span><span style="color: #8c8c8c;">()</span>.formate<span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'yyyy-MM-dd'</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div>
</div>
</section>

<section id="outline-container-org62ca594" class="outline-2">
<h2 id="org62ca594"><span class="section-number-2">4</span> 第四章</h2>
<div class="outline-text-2" id="text-4">
<p>
重构 P(152):
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">body</span> = request.body;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">username</span> = body.username;
<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">password</span> = body.password;

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #61afef;">body</span> = request.body;
<span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">username</span> = body.username;
<span style="color: #c678dd; font-weight: bold;">let</span> <span style="color: #61afef;">password</span> = body.password;

<span style="color: #c678dd; font-weight: bold;">const</span> <span style="color: #8c8c8c;">{</span> username, password <span style="color: #8c8c8c;">}</span> = request.body;
</pre>
</div>
</div>
</section>

<section id="outline-container-org53c9c5c" class="outline-2">
<h2 id="org53c9c5c"><span class="section-number-2">5</span> 第五章</h2>
</section>
<section id="outline-container-org0318b0a" class="outline-2">
<h2 id="org0318b0a"><span class="section-number-2">6</span> 第六章</h2>
</section>
<section id="outline-container-org670c9d4" class="outline-2">
<h2 id="org670c9d4"><span class="section-number-2">7</span> 第七章</h2>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2021-01-22</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
